# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
url='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names=pd.read_csv(url, sep=',')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names.groupby(baby_names['Gender']).count()

        Unnamed: 0      Id    Name    Year   State   Count
Gender
F           558846  558846  558846  558846  558846  558846
M           457549  457549  457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [10]:
names=baby_names.groupby(baby_names['Name'])

### Step 8. How many different names exist in the dataset?

In [17]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [35]:
baby_names['Name'].value_counts()

Name
Riley      1112
Avery      1080
Jordan     1073
Peyton     1064
Hayden     1049
           ...
Terryn        1
Yanna         1
Zemirah       1
Emmilyn       1
Coalton       1
Name: count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [39]:
occ=baby_names['Name'].value_counts()
occ=pd.DataFrame(occ)
occ

         count
Name
Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
...        ...
Terryn       1
Yanna        1
Zemirah      1
Emmilyn      1
Coalton      1

[17632 rows x 1 columns]

In [42]:
filt=occ['count']==1
occ[filt]

          count
Name
Grettell      1
Dawsen        1
Abenezer      1
Greenley      1
Daiden        1
...         ...
Terryn        1
Yanna         1
Zemirah       1
Emmilyn       1
Coalton       1

[3682 rows x 1 columns]

In [ ]:
<--3682

### Step 11. What is the median name occurrence?

In [58]:
baby_names['Name'].value_counts().median()

8.0

### Step 12. What is the standard deviation of names?

In [47]:
baby_names['Name'].value_counts().std()

122.0299635081389